kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/components/devunit/dps310/dps310_registers.h
#ifndef SENSOR_DPS310_REGISTERS_H
#define SENSOR_DPS310_REGISTERS_H

#define DPS310_PSR_B2_REG (0x00)
#define DPS310_PSR_B1_REG (0x01)
#define DPS310_PSR_B0_REG (0x02)

#define DPS310_TMP_B2_REG (0x03)
#define DPS310_TMP_B1_REG (0x04)
#define DPS310_TMP_B0_REG (0x05)

#define DPS310_PRS_CFG_REG (0x06)

#define DPS310_PRS_CFG_PM_RATE_MASK (0x0F)

#define DPS310_CFG_RATE_1_MEAS (0x00)
#define DPS310_CFG_RATE_2_MEAS (0x10)
#define DPS310_CFG_RATE_4_MEAS (0x20)
#define DPS310_CFG_RATE_8_MEAS (0x30)
#define DPS310_CFG_RATE_16_MEAS (0x40)
#define DPS310_CFG_RATE_32_MEAS (0x50)
#define DPS310_CFG_RATE_64_MEAS (0x60)
#define DPS310_CFG_RATE_128_MEAS (0x70)

#define DPS310_PRS_CFG_PM_PRC_SINGLE (0x00)  // low precision
#define DPS310_PRS_CFG_PM_PRC_2_TIMES (0x01)  // low power
#define DPS310_PRS_CFG_PM_PRC_4_TIMES (0x02)
#define DPS310_PRS_CFG_PM_PRC_8_TIMES (0x03)
#define DPS310_PRS_CFG_PM_PRC_16_TIMES (0x04) // standard
#define DPS310_PRS_CFG_PM_PRC_32_TIMES (0x05)
#define DPS310_PRS_CFG_PM_PRC_64_TIMES (0x06) // high precision
#define DPS310_PRS_CFG_PM_PRC_128_TIMES (0x07)

#define DPS310_TMP_CFG_REG (0x07)

#define DPS310_TMP_CFG_REG_TMP_EXT_INTERNAL (0x00)  // in ASIC
#define DPS310_TMP_CFG_REG_TMP_EXT_EXTERNAL (0x80)  // in pressure sensor MEMS element

#define DPS310_TMP_CFG_TMP_RATE_MASK (0x0F)

#define DPS310_TMP_CFG_TMP_PRC_SINGLE (0x00)  // default - measurment time 3.6 ms
#define DPS310_TMP_CFG_TMP_PRC_2_TIMES (0x01)
#define DPS310_TMP_CFG_TMP_PRC_4_TIMES (0x02)
#define DPS310_TMP_CFG_TMP_PRC_8_TIMES (0x03)
#define DPS310_TMP_CFG_TMP_PRC_16_TIMES (0x04)
#define DPS310_TMP_CFG_TMP_PRC_32_TIMES (0x05)
#define DPS310_TMP_CFG_TMP_PRC_64_TIMES (0x06)
#define DPS310_TMP_CFG_TMP_PRC_128_TIMES (0x07)

#define DPS310_MEAS_CFG_REG (0x08)

#define DPS310_MEAS_CFG_COEF_RDY_AVAILABLE (0x80)
#define DPS310_MEAS_CFG_SENSOR_RDY_COMPLETE (0x40)
#define DPS310_MEAS_CFG_TMP_RDY (0x20)
#define DPS310_MEAS_CFG_PRS_RDY (0x10)

#define DPS310_MEAS_CFG_MEAS_CTRL_MASK (0x07)
#define DPS310_MEAS_CFG_MEAS_CTRL_IDLE (0x00)
#define DPS310_MEAS_CFG_MEAS_CTRL_PRS (0x01)
#define DPS310_MEAS_CFG_MEAS_CTRL_TMP (0x02)
#define DPS310_MEAS_CFG_MEAS_CTRL_CONTINUOUS_PRS (0x05)
#define DPS310_MEAS_CFG_MEAS_CTRL_CONTINUOUS_TMP (0x06)
#define DPS310_MEAS_CFG_MEAS_CTRL_CONTINUOUS_PRS_TMP (0x07)

#define DPS310_CFG_REG_REG (0x09)
#define DPS310_CFG_RET_INT_HL (0x80)
#define DPS310_CFG_RET_INT_SEL (0x70)
#define DPS310_CFG_RET_TMP_SHIFT_EN (0x08)
#define DPS310_CFG_RET_PRS_SHIFT_EN (0x04)
#define DPS310_CFG_RET_FIFO_EN (0x02)
#define DPS310_CFG_RET_TMP_SPI_MODE (0x01)

#define DPS310_INT_STS_REG (0x0A)
#define DPS310_INT_STS_INT_FIFO_FULL_MASK (0x04)
#define DPS310_INT_STS_INT_TMP_MASK (0x02)
#define DPS310_INT_STS_INT_PRS_MASK (0x01)

#define DPS310_FIFO_STS_REG (0x0B)
#define DPS310_FIFO_STS_FIFO_FULL_MASK (0x02)
#define DPS310_FIFO_STS_FIFO_EMPTY_MASK (0x01)

#define DPS310_RESET_REG (0x0C)
#define DPS310_RESET_FIFO_FLUSH (0x80)
#define DPS310_RESET_SOFT_RST_VALUE (0x09)

#define DPS310_PRODUCT_ID_REG (0x0D)
#define DPS310_PRODUCT_ID_VALUE (0x10)
#define DPS310_PRODUCT_ID_REV_ID_MASK (0xF0)
#define DPS310_PRODUCT_ID_PROD_ID_MASK (0x0F)

#define DPS310_COEF_REG (0x10)

#define DPS310_TMP_COEF_SRCE (0x28)

#define DPS310_TMP_COEF_SRCE_MASK (0x80)
#define DPS310_TMP_COEF_SRCE_EXTERNAL (0x80)
#define DPS310_TMP_COEF_SRCE_INTERNAL (0x00)

#endif